fun compose f g = fn x => f (g x)

fun repeat 0 f = (fn x => x)
  | repeat n f = compose f (repeat (n-1) f)

val dx = 0.0001
fun diff f x = (f (x + dx) - f x)/dx 

fun diffN n f = (repeat n diff) f


val g = diffN 3 (fn x => Math.cos x)
fun c x =  Math.sin x

(*計算式　g 1.4 得られた値 0.985461712233
計算式　c 1.4 得られた値 0.985449729988　比較結果　ほぼ一致
計算式　g 3.3 得られた値 ~0.157762691799
計算式　c 3.3 得られた値 ~0.157745694143　比較結果　ほぼ一致
計算式　g 1.85 得られた値 0.961175583569 
計算式　c 1.85 得られた値 0.961275202975　比較結果　ほぼ一致
計算式　g 6.0 得られた値 ~0.279554157601
計算式　c 6.0 得られた値 ~0.279415498199　比較結果　ほぼ一致
計算式　g 4.5 得られた値 ~0.977606884334
計算式　c 4.5 得られた値 ~0.977530117665　比較結果　ほぼ一致*)
